DataProcessors/СформироватьПроводки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>СформироватьПроводки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/Закупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>Закупки</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/СформироватьПроводки/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакупкиОбороты.Номенклатура КАК Номенклатура,
		|	ЗакупкиОбороты.СуммаОборот КАК СуммаОборот,
		|	ЗакупкиОбороты.КоличествоОборот КАК КоличествоОборот
		|ИЗ
		|	РегистрНакопления.Закупки.Обороты(&НачалоМесяца, &КонецМесяца, , ) КАК ЗакупкиОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		|	ПродажиОбороты.КоличествоОборот КАК КоличествоОборот,
		|	ПродажиОбороты.СебестоимостьОборот КАК СебестоимостьОборот,
		|	ПродажиОбороты.ВыручкаОборот КАК ВыручкаОборот
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоМесяца, &КонецМесяца, , ) КАК ПродажиОбороты";
	
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	// закупки
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[0].Выбрать();
	Док = документы.Операция.СоздатьДокумент();
	Док.Дата = КонецМесяца(Дата);
	Док.Записать();
	
	НЗ = Док.Движения.РегистрБухгалтерии;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Проводка = НЗ.Добавить();
		Проводка.Период = КонецМесяца(Дата);
		проводка.СчетДт = ПланыСчетов.ХозУчет.Товары;
		проводка.СчетКт = ПланыСчетов.ХозУчет.Поставщики;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВыборкаДетальныеЗаписи.Номенклатура; 
		Проводка.Сумма = ВыборкаДетальныеЗаписи.СуммаОборот;
		Проводка.КоличествоДт = ВыборкаДетальныеЗаписи.КоличествоОборот;
	КонецЦикла;
	НЗ.Записать();
	
	// продажи
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[1].Выбрать();
	Док = документы.Операция.СоздатьДокумент();
	Док.Дата = КонецМесяца(Дата);
	Док.Записать();
	
	НЗ = Док.Движения.РегистрБухгалтерии;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Проводка = НЗ.Добавить();
		Проводка.Период = КонецМесяца(Дата);
		проводка.СчетДт = ПланыСчетов.ХозУчет.Покупатели;
		проводка.СчетКт = ПланыСчетов.ХозУчет.ПрибылиУбытки;
		Проводка.Сумма = ВыборкаДетальныеЗаписи.ВыручкаОборот;
		
		Проводка = НЗ.Добавить();
		Проводка.Период = КонецМесяца(Дата);
		проводка.СчетДт = ПланыСчетов.ХозУчет.ПрибылиУбытки;
		проводка.СчетКт = ПланыСчетов.ХозУчет.Товары;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВыборкаДетальныеЗаписи.Номенклатура; 
		Проводка.Сумма = ВыборкаДетальныеЗаписи.СебестоимостьОборот;
		Проводка.КоличествоКт = ВыборкаДетальныеЗаписи.КоличествоОборот;
	КонецЦикла;
	НЗ.Записать();
//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
	ПоказатьОповещениеПользователя("Ок");
КонецПроцедуры
